# 1) for - სინტაქსის შემადგენელი keyword(ნაწილი)
# 2) i - ცვლადის დასახელება (i - არის სტანდარტული სახელი)
# 3) in - სინტაქსის შემადგენელი keyword(ნაწილი)
# 4) range() - გამოიტანოს კონტენტი იმდენჯერ რამდენიც ჩაწერილია რკალურ ფრჩხილებში - ეს არის რკალური ფრჩხილები - ()
# 5) : - სინტაქსის შემადგენელი ნაწილი

# 6) range() - მოიცავს 3 პარამეტრს
# 1) საიდან დაიწყოს
# 2) სადამდე გაგრძელდეს
# 3) რამდენით გადადგას ნაბიჯი




# for i in range(500):
   # print("Goa Is Best")


# while loop

while True:
    print("hello")

 
# 1) Syntax
# 2) purpose
# 3) flexbility

